#include <stdio.h>
#include <stdlib.h>

int підрахуватиКількістьЕлементівМеншихЗа(int arr[], int size, int num) {
    int кількість = 0;
    for (int i = 0; i < size; i++) {
        if (arr[i] < num) {
            кількість++;
        }
    }
    return кількість;
}

int добутокМіжНулями(int arr[], int size) {
    int добуток = 1;
    int першийІндексНуля = -1;
    
    for (int i = 0; i < size; i++) {
        if (arr[i] == 0) {
            if (першийІндексНуля == -1) {
                першийІндексНуля = i;
            } else {
                // Знайдено другий нуль, виходимо з циклу
                break;
            }
        } else if (першийІндексНуля != -1) {
            добуток *= arr[i];
        }
    }
    
    return добуток;
}

void ініціалізуватиМасив(int arr[], int size) {
    for (int i = 0; i < size; i++) {
        arr[i] = rand() % 201 - 100; // Генеруємо випадкове число з діапазону [-100;100]
    }
}

void вивестиМасив(int arr[], int size) {
    for (int i = 0; i < size; i++) {
        printf("%d ", arr[i]);
    }
    printf("\n");
}

int main() {
    const int РОЗМІР = 10; // Розмір масиву
    int arr[РОЗМІР];
    
    // Ініціалізація та виведення масиву
    ініціалізуватиМасив(arr, РОЗМІР);
    printf("Масив: ");
    вивестиМасив(arr, РОЗМІР);
    
    // Кількість елементів, менших за число сім
    int кількістьМеншихСім = підрахуватиКількістьЕлементівМеншихЗа(arr, РОЗМІР, 7);
    printf("Кількість елементів, менших за число 7: %d\n", кількістьМеншихСім);
    
    // Добуток елементів масиву, розташованих між першим і другим нульовими елементами
    int добутокМіжНулямиРезультат = добутокМіжНулями(arr, РОЗМІР);
    printf("Добуток елементів між першим і другим нульовими елементами: %d\n", добутокМіжНулямиРезультат);
    
    return 0;
}
